In [5]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns

import warnings; warnings.filterwarnings(action='once')

In [6]:
large = 22; med = 16; small = 12
params = {'axes.titlesize': large,
          'legend.fontsize': med,
          'figure.figsize': (16, 10),
          'axes.labelsize': med,
          'axes.titlesize': med,
          'xtick.labelsize': med,
          'ytick.labelsize': med,
          'figure.titlesize': large}
plt.rcParams.update(params)
plt.style.use('seaborn-whitegrid')
sns.set_style("white")
%matplotlib inline

In [21]:
df_2018 = pd.read_csv("etatcivil2018_mar2018_csv/FD_MAR_2018.csv", sep=';', low_memory=False)
df_2018_2 = pd.read_csv("etatcivil2018_mar2018_csv/Varmod_MAR_2018.csv", sep=';', low_memory=False)

In [28]:
print(df_2018.shape)
df_2018.head()

(234735, 18)

,AMAR,ANAIS1,ANAIS2,DEPDOM,DEPMAR,DEPNAIS1,DEPNAIS2,ETAMAT1,ETAMAT2,INDNAT1,INDNAT2,JSEMAINE,MMAR,NBENFCOM,SEXE1,SEXE2,TUCOM,TUDOM
0,2018,1999,1999,99,01,99,99,1,1,2,2,6,11,N,M,F,NaN,9
1,2018,1987,1987,99,01,70,99,1,1,1,2,6,8,N,M,F,NaN,9
2,2018,1990,1990,99,01,74,01,1,1,1,1,6,7,N,M,F,NaN,9
3,2018,1985,1986,99,01,69,99,1,1,1,2,6,12,N,M,F,NaN,9
4,2018,1985,1986,99,01,69,99,1,1,1,2,6,12,N,M,F,NaN,9

In [34]:
print(df_2018_2.shape)
df_2018_2.head(5)

(649, 6)

  COD_VAR                           LIB_VAR COD_MOD LIB_MOD TYPE_VAR  LONG_VAR
0    AMAR                  Année du mariage    2019    2019     CHAR         4
1  ANAIS1  Année de naissance du conjoint 1    1921    1921     CHAR         4
2  ANAIS1  Année de naissance du conjoint 1    1922    1922     CHAR         4
3  ANAIS1  Année de naissance du conjoint 1    1923    1923     CHAR         4
4  ANAIS1  Année de naissance du conjoint 1    1924    1924     CHAR         4

In [27]:
df_2019 = pd.read_csv("etatcivil2019_mar2019_csv/FD_MAR_2019.csv", sep=';', low_memory=False)
df_2019_2 = pd.read_csv("etatcivil2019_mar2019_csv/Varmod_MAR_2019.csv", sep=';', low_memory=False)

In [30]:
print(df_2019.shape)
df_2019.head()

(224740, 18)

,AMAR,ANAIS1,ANAIS2,DEPDOM,DEPMAR,DEPNAIS1,DEPNAIS2,ETAMAT1,ETAMAT2,INDNAT1,INDNAT2,JSEMAINE,MMAR,NBENFCOM,SEXE1,SEXE2,TUCOM,TUDOM
0,2019,1979,1979,99,01,99,01,4,4,2,1,6,12,N,M,F,NaN,9
1,2019,1990,1990,99,01,99,30,1,1,2,1,2,12,N,M,F,NaN,9
2,2019,1992,1995,99,01,75,01,1,1,1,1,6,8,N,M,F,NaN,9
3,2019,1982,1989,99,01,99,72,1,1,2,1,6,8,N,M,F,NaN,9
4,2019,1989,1988,99,01,69,01,1,1,1,1,6,6,N,M,F,NaN,9

In [35]:
print(df_2019_2.shape)
df_2019_2.head()

(641, 6)

  COD_VAR                           LIB_VAR COD_MOD LIB_MOD TYPE_VAR  LONG_VAR
0    AMAR                  Année du mariage    2018    2018     CHAR         4
1  ANAIS1  Année de naissance du conjoint 1    1920    1920     CHAR         4
2  ANAIS1  Année de naissance du conjoint 1    1921    1921     CHAR         4
3  ANAIS1  Année de naissance du conjoint 1    1922    1922     CHAR         4
4  ANAIS1  Année de naissance du conjoint 1    1923    1923     CHAR         4

In [49]:
import csv
df_2020 = pd.read_csv("martigues-mariages-pacs-2020.csv", sep=';', encoding = "ISO-8859-1")

In [50]:
df_2020.head()

   ANNEE  MOIS MOIS_STR  ACTE_DE    ETAT  TOTAL
0   1980     1  JANVIER  MARIAGE  VALIDÉ      1
1   1980     2  FEVRIER  MARIAGE  VALIDÉ      4
2   1980     3     MARS  MARIAGE  VALIDÉ      3
3   1980     4    AVRIL  MARIAGE  VALIDÉ      7
4   1980     5      MAI  MARIAGE  VALIDÉ      3